Revit 2024 API
BuiltInFailures.StairRampFailures.StairsActualRunWidthLessThanMinimumFailure Property
 Actual run width is less than minimum run width defined in stairs type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsActualRunWidthLessThanMinimumFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsActualRunWidthLessThanMinimumFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsActualRunWidthLessThanMinimumFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace